# GetNearestLevelId Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Level..::..GetNearestLevelId Method
Level Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetNearestLevelId(Document, Double) | Returns id of the Level which is closest to the specified elevation. |
| GetNearestLevelId(Document, Double, Double%) | Returns id of the Level which is closest to the specified elevation. |

# See Also
Level Class
Level Members
Autodesk.Revit.DB Namespace